app/Controllers/Venta.php

    public function index()
    {
        $data["venta"] = $this->venta->findAll();
        $data["producto"] = $this->producto->findAll();
        $data["persona"] = $this->persona->getPersona(3);
        $data["tipopago"] = $this->tipopago->findAll();
        $data["detalleventa"] = $this->detalleVenta->findAll();
---
SELECT *
FROM `venta`
SELECT *
FROM `producto`
SELECT *
FROM `tipopago`
SELECT *
FROM `detalleventa`

    public function listarVenta(){
        $data["venta"] = $this->venta->getVenta();
        $data["persona"] = $this->persona->findAll();
        $data["tipopago"] = $this->tipopago->findAll();
---
SELECT *
FROM `persona`
SELECT *
FROM `tipopago`